Repository: smolikja/nuke-nanny-app
Catalog: lib/core/l10n/app_*.arb
Languages: cs

# appTitle
source: GrokAI Assistant
cs: GrokAI Asistent

# chatPageTitle
source: Chat with Grok
cs: Chat s Grok

# messageInputHint
source: Type your message...
cs: Napište zprávu...

# sendButtonLabel
source: Send
cs: Odeslat

# emptyMessageError
source: Message cannot be empty
cs: Zpráva nemůže být prázdná

# emptyChatPlaceholder
source: Start a conversation with Grok AI
cs: Začněte konverzaci s Grok AI

# userRole
source: You
cs: Vy

# error_network_connection
source: No internet connection. Please check your network settings.
cs: Žádné připojení k internetu. Zkontrolujte nastavení sítě.

# error_server
source: Server error. Please try again later.
cs: Chyba serveru. Zkuste to prosím později.

# error_authentication
source: Authentication failed. Please log in again.
cs: Ověření selhalo. Přihlaste se prosím znovu.

# error_local_storage
source: Storage error. Please restart the app.
cs: Chyba úložiště. Restartujte prosím aplikaci.

# error_validation
source: Invalid input. Please check your data.
cs: Neplatný vstup. Zkontrolujte prosím svá data.

# error_unexpected
source: Unexpected error occurred. Please try again.
cs: Došlo k neočekávané chybě. Zkuste to prosím znovu.

# error_rate_limit
source: Rate limit exceeded. Please try again later.
cs: Překročen limit požadavků. Zkuste to prosím později.

# error_invalid_api_key
source: Invalid API key. Please check your configuration.
cs: Neplatný API klíč. Zkontrolujte prosím konfiguraci.

# error_model_unavailable
source: Selected AI model is currently unavailable.
cs: Vybraný AI model je momentálně nedostupný.

# retryButtonLabel
source: Retry
cs: Zkusit znovu

# cancelButtonLabel
source: Cancel
cs: Zrušit

# clearChatButtonLabel
source: Clear Chat
cs: Vymazat chat

# settingsButtonLabel
source: Settings
cs: Nastavení
